/*-----------------------------------------------------------------------------
	ブロッククラス
	author	HaradaYuto
	since	20140519
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/

#include "CBlock.h"
#include "CInstancingObject.h"
#include "Define.h"
#include "CScrollManager.h"

/*-----------------------------------------------------------------------------
	初期化
-----------------------------------------------------------------------------*/

HRESULT CBlock::Init()
{
	return S_OK;
}

/*-----------------------------------------------------------------------------
	後処理
-----------------------------------------------------------------------------*/

void CBlock::Uninit()
{
	Release();
}

/*-----------------------------------------------------------------------------
	更新
-----------------------------------------------------------------------------*/

void CBlock::Update()
{

}

/*-----------------------------------------------------------------------------
	描画
-----------------------------------------------------------------------------*/

void CBlock::Draw()
{
	D3DXVECTOR2 scroll_val = CScrollManager::GetScrollWorld();
	D3DXVECTOR2 scroll_pos;

	//スクロール込の位置
	scroll_pos = m_pos - scroll_val;

	//画面外かどうかの判定
	if( scroll_pos.x > -m_scl.x/2 && scroll_pos.x < SCREEN_WIDTH + m_scl.x/2 )
	{
		if( scroll_pos.y > -m_scl.y/2 && scroll_pos.y < SCREEN_HEIGHT + m_scl.y/2 )
		{
			// 先に下地となるテクスチャを設置
			if (m_secondTexIdX != -1 && m_secondTexIdY != -1)
			{
				m_pInsObj->AddDataScreen(m_scl, m_rot, scroll_pos, m_secondTexIdX, m_secondTexIdY);
			}

			//配置
			m_pInsObj->AddDataScreen( m_scl, m_rot, scroll_pos, m_blockIdX, m_blockIdY );
		}
	}
	
}