/*-----------------------------------------------------------------------------
	デバッグ表示クラス
	author	OkadaMoeto
	since	20140722
-----------------------------------------------------------------------------*/

// ２重インクルード防止
#pragma once

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/
#include "Main.h"

/*-----------------------------------------------------------------------------
	デバッグ表示クラス
-----------------------------------------------------------------------------*/
class CDebugProcDX9
{
	public:
		CDebugProcDX9();
		~CDebugProcDX9();

		void Init(void);
		void Uninit(void);

		/*-----------------------------------------------------------------------------
			デバッグ文字の書込み
			param	*fmt		書式文字列
			param	...			可変個引数
		-----------------------------------------------------------------------------*/
		static void Print(char *fmt, ...);
		
		// デバッグ表示用文字列の描画
		static void Draw(void);

		/*-----------------------------------------------------------------------------
			デバッグ表示フラグの取得
			return	bool		デバッグ表示フラグの値
		-----------------------------------------------------------------------------*/
		static bool GetDisp(void){ return m_bDisp; }
		/*-----------------------------------------------------------------------------
			デバッグ表示フラグの設定
			param	b		デバッグ表示フラグの値
		-----------------------------------------------------------------------------*/
		static void SetDisp(bool b){ m_bDisp = b; }

		/*-----------------------------------------------------------------------------
			フレームカウンター取得
			return	int		フレームカウンターの値
		-----------------------------------------------------------------------------*/
		static int GetCountFrame(void){ return m_countFrame; }

	private:
		// デバッグ表示文字列最大数
		static const int LENGTH_STRING_BUFF = 1028;

		// 文字の高さ
		static const int FONT_HEIGHT = 18;
		// 文字の幅
		static const int FONT_WIDTH = 8;

		// D3DXFONTへのポインタ
		static LPD3DXFONT m_pD3DXFont;

		// デバッグ表示用文字列
		static char m_aStr[LENGTH_STRING_BUFF];

		// デバッグON/OFF
		static bool m_bDisp;

		// フレームカウンター
		static int m_countFrame;
};
