/*-----------------------------------------------------------------------------
	DirectXデバイスの生成と描画クラス
	author	OkadaMoeto
	since	20140415
-----------------------------------------------------------------------------*/

// ２重インクルード防止
#pragma once

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/
#include "Main.h"

/*-----------------------------------------------------------------------------
	描画クラス
-----------------------------------------------------------------------------*/
class CRenderer
{
	public:
		CRenderer();
		~CRenderer();

		HRESULT Init(HWND hWnd, BOOL bWindow);
		void Uninit(void);
		void Update(void);
		void Draw(void);

		/*-----------------------------------------------------------------------------
			Direct3Dデバイスの取得
			return	LPDIRECT3DDEVICE9		Direct3Dデバイス
		-----------------------------------------------------------------------------*/
		LPDIRECT3DDEVICE9 GetDevice(void){ return m_pD3DDevice; }
		/*-----------------------------------------------------------------------------
			DirectXパラメータの取得
			return	D3DPRESENT_PARAMETERS		DirectXパラメータ
		-----------------------------------------------------------------------------*/
		D3DPRESENT_PARAMETERS GetParameters(void){ return m_pParameters; }

		/*-----------------------------------------------------------------------------
			ワイヤーフレームフラグの取得
			return	bool		ワイヤーフレームフラグの値
		-----------------------------------------------------------------------------*/
		static bool GetFillModeWireFrame(void){ return m_bFillModeWireFrame; }
		/*-----------------------------------------------------------------------------
			ワイヤーフレームフラグの設定
			param	flag		ワイヤーフレームフラグの設定値
		-----------------------------------------------------------------------------*/
		static void SetFillModeWireFrame(bool flag){ m_bFillModeWireFrame = flag; }

	private:
		// Direct3Dオブジェクト
		LPDIRECT3D9 m_pD3D;

		// Deviceオブジェクト(描画に必要)
		LPDIRECT3DDEVICE9 m_pD3DDevice;

		// パラメータ保存用
		D3DPRESENT_PARAMETERS m_pParameters;

		// 塗りつぶしモードのワイヤーフレーム表示のフラグ
		static bool m_bFillModeWireFrame;
};
