/*-----------------------------------------------------------------------------
	リザルト画面フェーズクラス
	author	OkadaMoeto
	since	20140713
-----------------------------------------------------------------------------*/

// ２重インクルード防止
#pragma once

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/
#include "Main.h"
#include "CPhase.h"

/*-----------------------------------------------------------------------------
	リザルト画面フェーズクラス
-----------------------------------------------------------------------------*/
class CFade;
class CScene2D;
class CResult : public CPhase
{
	public:
		CResult();
		~CResult();

		void Init(void);
		void Uninit(void);
		void Update(void);

	private:
		// 「遊んでくれてありがとう」のメッセージオブジェクト
		CScene2D* m_thankmsg;

		float m_countAutoChange;
};
