/*-----------------------------------------------------------------------------
	タイトル画面フェーズクラス
	author	OkadaMoeto
	since	20140713
-----------------------------------------------------------------------------*/

// ２重インクルード防止
#pragma once

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/
#include "Main.h"
#include "CPhase.h"

/*-----------------------------------------------------------------------------
	タイトル画面フェーズクラス
-----------------------------------------------------------------------------*/
class CScene2D;
class CTitle : public CPhase
{
	public:
		CTitle();
		~CTitle();

		void Init(void);
		void Uninit(void);
		void Update(void);

	private:
		// 2Dオブジェクトの点滅
		void Blink(CScene2D* pTarget, float flashTime);

		// プレスキー表示のインスタンス保存
		CScene2D* m_pressKey;

		// プレスキー点滅カウンター
		float m_countBlink;

		// プレスキー押下
		bool m_bDecide;

		// プレスキー押下後のカウンター
		float m_countDecided;
};
