/*-----------------------------------------------------------------------------
	エントリポイント(ウィンドウ生成)処理
	author	OkadaMoeto
	since	20140414
-----------------------------------------------------------------------------*/

// ２重インクルード防止
#pragma once

/*-----------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------*/
#include <Windows.h>
#include "d3dx9.h"
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"
#include "xaudio2.h"
#include "CManager.h"
#include "CRenderer.h"
#ifdef _DEBUG
#include "CDebugProcDX9.h"
#endif

/*-----------------------------------------------------------------------------
	ライブラリのリンク
-----------------------------------------------------------------------------*/
// "構成プロパティ" -> "リンカ" -> "入力" -> "追加の依存ファイル"に対象ライブラリを設定する]にて設定すれば書かなくてもよし
#pragma comment (lib, "winmm.lib")
#pragma comment (lib, "d3d9.lib")
#pragma comment (lib, "d3dx9.lib")
#pragma comment (lib, "dxguid.lib")
#pragma comment (lib, "dinput8")

/*-----------------------------------------------------------------------------
	マクロ定義
-----------------------------------------------------------------------------*/
// 2D頂点フォーマット( 頂点座標[2D] / 反射光 / テクスチャ座標 )
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)
// 3D頂点フォーマット( 頂点座標[3D] / 反射光 / テクスチャ座標 )
#define FVF_VERTEX_3D (D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_TEX1)

/*-----------------------------------------------------------------------------
	頂点フォーマットに合わせた頂点情報用(3D)構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR3 vtx;	// 頂点座標
	D3DXVECTOR3 nor;	// 法線ベクトル
	D3DCOLOR diffuse;	// 反射光
	D3DXVECTOR2 tex;	// テクスチャ座標
}VERTEX_3D;

/*-----------------------------------------------------------------------------
	頂点フォーマットに合わせた頂点情報用(2D)構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR3 vtx;	// 頂点座標
	float rhw;			// テクスチャのパースペクティブコレクト用(頂点変換)
	D3DCOLOR diffuse;	// 反射光
	D3DXVECTOR2 tex;	// テクスチャ座標
}VERTEX_2D;

/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
// FPS取得
int GetFPS();
